'--------------------------------------------------------------------------------------------------
' Portuguese (European - PT) language module for WINCONTIG
'
' Translated by:
'   Joaquim Carvalho (j.carvalho59<at>gmail<dot>com)
'
' Currently maintained by:
'   Marco D'Amato (md<at>mdtzone<dot>it)
'
' Last update: Dec 07, 2014
' Version: 1.35.03
'
' NOTE: Don´t translate '\n', '\t', '%s', '$c$' and '$d$'
'
'--------------------------------------------------------------------------------------------------
' Language Name of the module in your native language ***
' (e.g. Italiano, Français, etc)
'--------------------------------------------------------------------------------------------------
LNG=Português (Portugal)
'--------------------------------------------------------------------------------------------------
' File info panel *** Painel de informação dos ficheiros
'--------------------------------------------------------------------------------------------------
1=Ficheiros fragmentados
2=Ficheiros contíguos
3=Ficheiros desfragmentados
4=Ficheiros não processados
195=CURRENT SESSION
199=Start time:
200=Action:
222=Current operation:
214=Defragmenting
215=File Defragmentation
207=File Analysis
209=Completed
211=Aborted by the user
212=Canceled
213=Analyzing...
216=Skipped all objects
219=LAST SESSION
217=General
227=Total processed files:
228=Defragmented files:
234=n/a
240=FRAGMENTED
241=CONTIGUOUS
243=DEFRAGMENTED
254=Checking volumes for errors...
257=Disk cleaning up...
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons labels ***
'-------------------------------------------------------------------------------------
17=Adicionar
18=Eliminar
19=Propriedades
20=Carregar um perfil
21=Guardar o perfil
283=Fragmentos
294=Visualizar relatório
455=Filtrar
24=Desfragmentar
25=Parar
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons tooltips ***
'-------------------------------------------------------------------------------------
473=Adicionar
474=Adicionar um ou mais ficheiros à lista. Clicar na seta para adicionar pastas.
475=Remover
476=Remover os elementos seleccionados da lista.
477=Propriedades
478=Mostrar as propriedades dos elementos seleccionados.
479=Fragmentos
480=Mostrar informação adicional sobre os ficheiros seleccionados, como o tamanho e o número de fragmentos que o compõem.
481=Filtrar
482=Mostrar a caixa de diálogo Filtro para incluir ou excluir ficheiros, pastas e tipos de ficheiro, da análise e da desfragmentação.
483=Carregar um perfil
484=Carregar uma lista de elementos a partir dum ficheiro de perfil guardado previamente.
485=Guardar um perfil
486=Guardar a lista dos elementos num ficheiro de perfil.
26=Analisar
45=Analisar os ficheiros para determinar o seu nível de fragmentação. 
101=Desfragmentar
139=Reagrupar os ficheiros fragmentados para melhorar o desempenho do sistema. Clicar na seta para desfragmentar apenas os ficheiros selecionados no painel inferior.
122=Parar
136=Parar a operação em curso.
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Add" button) ***
'-------------------------------------------------------------------------------------
65=Adicionar ficheiro...\tCTRL+O
66=Adicionar pasta...\tCTRL+D
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Profile" button) ***
'-------------------------------------------------------------------------------------
155=<vazio>
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Defragment" button) ***
'-------------------------------------------------------------------------------------
365=Desfragmentar todos os ficheiros
156=Desfragmentar apenas os ficheiros fragmentados seleccionados
'----------------------------------------------------------------------------------------------
' Main program window - Items to be processed (Column Headers/Column Header Context Menu) ***
'----------------------------------------------------------------------------------------------
27=Nome
28=Tamanho
29=Estado
30=Tipo
248=Fragmentos
249=Blocos
250=Tamanho no disco
274=% no disco
472=Data da última modificação
487=Atributos
251=Padrão
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Status" Column) ***
'-------------------------------------------------------------------------------------
5=Fragmentado
6=Não fragmentado
7=Erro
8=Desfragmentado
146=Contíguos
369=Ignorado
424=A processar...
218=Skipped (filtered out)
220=Skipped (stored on SSD)
226=Aborted
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (misc) ***
'-------------------------------------------------------------------------------------
31=Adicionar aqui objectos para desfragmentar.
247=Pasta raiz
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (Context Menu) ***
'-------------------------------------------------------------------------------------
67=Abrir
68=Adicionar objecto
69=Ficheiro...\tCTRL+O
70=Pasta...\tCTRL+D
71=Eliminar elementos\tDEL
371=Adicionar à lista de exclusão
15=Analisar os elementos seleccionados
16=Desfragmentar os elementos seleccionados
72=Carregar um perfil...
73=Guardar perfil como...
223=Propriedades...
75=Rolagem automática
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Column Headers/Column Header Context Menu) ***
'--------------------------------------------------------------------------------------------------
9=Fragmentos
252=Blocos
253=Tamanho no disco
10=Tamanho
11=Nome do ficheiro
183=Path
275=% no disco
256=Padrão
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (misc) ***
'-------------------------------------------------------------------------------------
144=Ficheiros fragmentados
12=Não há ficheiros fragmentados.
428=Ainda não foi processado nenhum ficheiro.
'-------------------------------------------------------------------------------------
' Main program window - Tab Options ***
'-------------------------------------------------------------------------------------
187=&Show file name and path in separate columns
188=Show advanced options for the tabs.
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Context Menu) ***
'-------------------------------------------------------------------------------------
363=Seleccionar os ficheiros realçados
364=Desseleccionar os ficheiros realçados
367=Inverter a selecção
372=Adicionar à lista de exclusão
162=Abrir a localização do ficheiro
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" listview (checkbox) tooltip ***
'--------------------------------------------------------------------------------------------------
171=Seleccionar/Desseleccionar
161=Seleccionar ou desseleccionar todos os ficheiros listados.
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (Column Headers) ***
'--------------------------------------------------------------------------------------------------
128=Nome do ficheiro
245=Path
129=Erro
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (misc) ***
'--------------------------------------------------------------------------------------------------
98=Erros
145=Não encontrados erros durante o processamento dos ficheiros.
'-------------------------------------------------------------------------------------
' Main program window - Statusbar messages ***
'-------------------------------------------------------------------------------------
32=Inactivo
33=Total de objectos listados: 
127=Objeto
137=Desfragmentação
420=Total de ficheiros processados:
'-------------------------------------------------------------------------------------
' Main program window - File menu ***
'-------------------------------------------------------------------------------------
34=Ficheiro
35=Abrir
36=Adicionar objecto
37=Ficheiro...\tCTRL+O
38=Pasta...\tCTRL+D
39=Eliminar elementos\tDEL
370=Adicionar à lista de exclusões
284=Informação sobre os fragmentos...
224=Propriedades...
421=Guardar o relatório de análise...
41=Sair
'-------------------------------------------------------------------------------------
' Main program window - Profiles menu ***
'-------------------------------------------------------------------------------------
42=Perfis
43=Carregar um perfil...
44=Guardar perfil como...
157=Configurar a lista de perfis recentes...
'-------------------------------------------------------------------------------------
' Main program window - Action menu ***
'-------------------------------------------------------------------------------------
46=Acções
47=Analisar
49=Parar
50=Desfragmentar
148=Analisar os elementos seleccionados
150=Desfragmentar os elementos seleccionados
'-------------------------------------------------------------------------------------
' Main program window - View menu ***
'-------------------------------------------------------------------------------------
48=Ver
51=Barra de ferramentas
52=Painel de informação
76=Barra de estado
'-------------------------------------------------------------------------------------
' Main program window - Tools menu ***
'-------------------------------------------------------------------------------------
377=Ferramentas
470=Gerir o filtro...
'-------------------------------------------------------------------------------------
' Main program window - Options menu ***
'-------------------------------------------------------------------------------------
53=Opções
54=Em primeiro plano
55=Seleccionar a linha inteira
56=Mostrar as mensagens de confirmação
57=Não autorizar os elementos em duplicado
58=Fechar o programa quando terminar a desfragmentação
59=Desligar o computador quando terminar a desfragmentação
229=Não verificar os erros dos volumes
235=Estratégia de desfragmentação
236=Rápida
237=Inteligente
242=Língua
301=Definir prioridade
302=Alta
303=Superior à normal
304=Normal
305=Inferior à normal
306=Baixa
332=Limpeza de disco
333=Desactivada
334=Automática
335=Perguntar ao utilizador
361=Mostrar as mensagens de erro
348=Verificar os erros dos volumes
349=Desactivada
350=Automática
351=Perguntar ao utilizador
408=Configurar realçar...
488=Omitir SSD (Solid State Drive)
23=Desativar a detecção SSD (Solid State Drive)
102=Mostrar os icones de estado
140=Mostrar os icones sistema
'-------------------------------------------------------------------------------------
' Main program window - Help menu ***
'-------------------------------------------------------------------------------------
60=Ajuda
61=Licença
62=Mostrar parâmetros da linha de comando
64=Sobre o WinContig...
'-------------------------------------------------------------------------------------
' Menu Hints ***
'-------------------------------------------------------------------------------------
83=Adiciona ficheiros à lista de ficheiros.
84=Adiciona uma pasta à lista de ficheiros.
85=Elimina os elementos seleccionados da lista.
86=Adiciona os elementos listados num perfil à lista de ficheiros.
87=Guarda os elementos listados na lista de ficheiros num perfil.
88=Sai do WinContig.
89=Analisa os elementos.
92=Permite interromper o processo de adicionar.
93=Permite interromper a análise dos ficheiros.
110=Desfragmenta os ficheiros.
94=Mostra a janela principal do programa sempre em primeiro plano.
95=Activa ou desactiva a selecção de linha inteira.
96=Mostra a informação do programa, o número da versão e o direito de autor.
99=Fecha o programa após o final da desfragmentação.
100=Desliga o computador após o final da desfragmentação.
103=Activa ou desactiva o desenrolar dos ficheiros.
104=Activa ou desactiva as mensagens de confirmação.
105=Abre os ficheiros seleccionados usando as aplicações associadas com eles.
106=Mostra os parâmetros da linha de comando aceites pelo WinContig.
107=Mostra o acordo de licença.
108=Não permite entradas duplicadas na lista de ficheiros.
225=Mostra as propriedades dos elementos seleccionados.
230=Não verifica os erros nos volumes antes de desfragmentar os ficheiros.
238=Desfragmenta os ficheiros sem optimizar o deslocamento dos blocos (clusters) (mais rápido).
239=Desfragmenta os ficheiros optimizando o deslocamento dos blocos (clusters) (mais lento).
255=Mostra o relatório de análise.
285=Mostra informação adicional sobre a desfragmentação do ficheiro.
336=Não elimina os ficheiros temporários antes de desfragmentar os ficheiros.
337=Elimina automaticamente os ficheiros temporários antes de desfragmentar os ficheiros.
109=Pergunta ao utilizador se deseja eliminar os ficheiros temporários antes da desfragmentação dos ficheiros.
352=Não verifica erros nos volumes antes da desfragmentação dos ficheiros.
353=Verifica automaticamente erros nos volumes antes de desfragmentar os ficheiros.
354=Pergunta ao utilizador se deseja verificar erros nos volumes antes de desfragmentar os ficheiros.
362=Mostra mensagens de erro durante o processo de eliminação dos ficheiros temporários.
373=Adiciona os elementos seleccionados à lista de exclusão.
471=Faz a gestão das listas de Inclusão e Exclusão.
409=Altera as cores de realce dos elementos.
429=Inverte os elementos seleccionados e não seleccionados.
430=Selecciona os elementos realçados.
431=Desmarca os elementos seleccionados.
422=Guarda o resultado da análise.
22=Não detecta automaticamente os SSD (Solid-State Drives).
13=Não desfragmenta ficheiros nos SSD (Solid-State Drives).
82=Mostra ou oculta a barra de ferramentas.
90=Mostra ou oculta o painel de informação.
91=Mostra ou oculta a barra de estado
14=Desfragmenta apenas os ficheiros fragmentados seleccionados no painel inferior.
141=Permite-lhe interromper a operação em curso.
131=Analisa apenas os elementos seleccionados no painel superior.
138=Desfragmenta apenas os elementos seleccionados no painel superior.
158=Modifica o número de perfis mostrados na lista de perfis recentes.
135=Mostra os icones de estado ao lado de cada icone de elemento no painel superior.
160=Mostra os icones de sistema em vez dos icones do WinContig junto a cada elemento.
163=Abre a pasta contendo o ficheiro seleccionado.
'-------------------------------------------------------------------------------------
' Analysis Report ***
'-------------------------------------------------------------------------------------
177=Número de ficheiros fragmentados
178=Número de ficheiros contíguos
179=Número de ficheiros não analisados devido a erros
182=Número de ficheiros processados
231=Lista dos ficheiros fragmentados:
232=Lista dos ficheiros não analisados:
289=Documento de texto (*.txt)|*.txt|Todos os ficheiros (*.*)|*.*|
290=Guardar relatório
291=Relatório guardado com sucesso.
292=Relatório de análise do WinContig criado:
293=Estatísticas do ficheiro
'-------------------------------------------------------------------------------------
' "Add files" dialog box ***
'-------------------------------------------------------------------------------------
111=Adicionar ficheiro(s)
112=Todos os ficheiros (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Add folder" dialog box ***
'-------------------------------------------------------------------------------------
113=Seleccione a pasta a adicionar à lista, e então clique Adicionar pasta. Pode adicionar mais de uma pasta.
244=Adicionar pasta
246=Adicionar pasta à lista
'-------------------------------------------------------------------------------------
' "Load profile" dialog box ***
'-------------------------------------------------------------------------------------
114=Carregar perfil
115=Perfis do WinContig (*.wcp)|*.wcp|Todos os ficheiros (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Save profile" dialog box ***
'-------------------------------------------------------------------------------------
116=Guardar perfil
117=Perfis do WinContig (*.wcp)|*.wcp|Todos os ficheiros (*.*)|*.*|
118=O perfil foi guardado com sucesso.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box ***
'-------------------------------------------------------------------------------------
119=Importação de perfil
120=Acrescentar
121=Substituir
123=A lista de ficheiros não está vazia.
124=Clicar <b>Acrescentar<\b> para adicionar os objectos listados no perfil aos objectos que já estão na lista. Clicar <b>Substituir<\b> para substituir os objectos da lista pelos que estiverem listados no perfil.
125=O ficheiro '%s' não é um perfil válido do WinContig.
126=O perfil indicado na linha de comando não existe.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box - Items don't exist ***
'-------------------------------------------------------------------------------------
40=Elementos
130=Importação de perfil
132=Não é possível encontrar alguns elementos listados no perfil. Eles podem ter sido renomeados, movidos ou eliminados.
133=Lista de elementos que não foram importados:
'-------------------------------------------------------------------------------------
' "Check disk" dialog box ***
'-------------------------------------------------------------------------------------
308=Verificação de disco
320=Antes de iniciar a desfragmentação, pode procurar erros nos volumes. Aconselha-se vivamente verificar a integridade dos ficheiros armazenados nos seus discos antes de desfragmentar os ficheiros. Faça duplo clique sobre um disco para mostrar as suas propriedades.
309=No futuro, não verificar os volumes.
310=A analisar o disco %s... Por favor, aguarde.
311=Progresso:
321=Passo 1 de 3
355=Passo 2 de 3
356=Passo 3 de 3
313=Verificar disco
314=Não verificar disco
315=Erro de disco!
316=Erro na verificação do disco. Recomenda-se vivamente fechar o Wincontig e reparar todos os erros ocorridos.
317=O Windows não pode executar a verificação de disco em drives de CD-ROM e DVD-ROM.
318=O WinContig detectou problemas com um volume. Recomendamos sair do WinContig e corrigir o problema.\nAlternativamente, também poderá continuar normalmente.
319=Iniciar automaticamente a desfragmentação se nenhum problema for encontrado.
323=Mostrar detalhes.
324=O disco ainda não foi analisado.
325=Ocultar detalhes.
326=A verificação do disco está terminada.
328=Relatório de análise:
329=Nenhum problema encontrado no disco.
330=Procurar erros no disco.
331=O Windows não pode verificar um disco ligado através de uma rede.
432=Volume
433=Sistema de ficheiros
434=Tamanho total
435=Espaço livre
436=% Espaço livre
437=Disco desconhecido
438=Leitor amovível
439=Disco duro
440=Leitor remoto
441=Disco óptico
442=Disco-RAM
443=Estado da sessão
444=A analisar...
445=Terminado
'-------------------------------------------------------------------------------------
' "Disk Cleanup" dialog box ***
'-------------------------------------------------------------------------------------
339=Limpeza de disco
340=Eliminação de ficheiros temporários
357=Iniciar limpeza de disco
358=Não iniciar limpeza de disco
338=No futuro, não eliminar ficheiros temporários.
359=Antes de iniciar o processo de desfragmentação, pode eliminar ficheiros temporários para recuperar espaço no disco.
342=A calcular...
343=A eliminar ficheiros temporários... Por favor, espere.
344=Progresso:
345=Função GetTempPath falhou com o erro %s !
346=Não é possível eliminar os ficheiros temporários porque eles estão armazenados na pasta raiz!
347=Não é possível eliminar os ficheiros temporários porque o caminho temporário seguinte não existe:\n\n%s
446=Usar o WinContig para eliminar ficheiros temporários.
181=E&mpty Recycle Bin
447=Usar uma aplicação externa para apagar ficheiros temporários
448=Programa:
449=Parâmetros de linha de comando suplementares:
450=Procurar...
451=Seleccionar o programa
452=Programas (*.exe)|*.exe|Todos os ficheiros (*.*)|*.*|
453=Nenhum programa externo indicado.
454=O programa externo indicado não existe !
'-------------------------------------------------------------------------------------
' "Exclusion/Inclusion List" dialog box ***
'-------------------------------------------------------------------------------------
469=Filtrar
381=Adicionar pasta...
382=Adicionar ficheiro...
399=Adicionar máscara
383=Remover elemento
385=Para prevenir a indesejada realocação de alguns dados, pode excluir da desfragmentação certos elementos específicos. Os ficheiros e pastas listados nesta janela não serão analisados nem desfragmentados.
386=Gerir a lista de exclusão
387=Lista de elementos excluídos:
391=Ignorar ficheiros maiores que (KB):
392=KB
393=MB
394=GB
456=Filtrar 
457=Adicionar uma máscara
458=Excluir uma máscara
459=Máscara a adicionar:
460=Afim de tratar elementos específicos, pode definir uma ou várias máscaras. WinContig apenas processará os elementos correspondentes às máscaras listadas nesta janela. Para definir várias máscaras, separe cada uma por um ponto-e-vírgula (;).
461=Gerir a lista de inclusão
462=Lista de elementos excluídos:
463=Excluir
464=Incluir
'-------------------------------------------------------------------------------------
' "Mask file" dialog box ***
'-------------------------------------------------------------------------------------
400=Adicionar máscara
401=Especificar uma ou mais máscaras para excluir ficheiros e/ou pastas. Para multiplas máscaras separe-as com ponto-e-vírgula (;).\n\nExemplo: *.dll;*.ocx;*.tmp
404=As máscaras não podem conter os seguintes caracteres: \ / : < > | "
419=Caractere inválido
405=Máscaras de exclusão:
402=Adicionar
'-------------------------------------------------------------------------------------
' "Configure highlighting" dialog box ***
'-------------------------------------------------------------------------------------
410=Configurar realçar
411=Aqui pode configurar as cores de realce dos elementos. Para modificar a cor dum elemento, clique no botão colorido correspondente. Para activar ou desactivar o realce dum elemento, marque ou desmarque a caixa de verificação correspondente.
412=Elemento fragmentado
413=Elemento contíguo
414=Elemento desfragmentado
415=Erro
416=Elemento omitido
418=Destaque da linha inteira
'-------------------------------------------------------------------------------------
' "Configure Profiles List" dialog box ***
'-------------------------------------------------------------------------------------
151=Lista dos perfis recentes
152=Configurar a lista dos perfis recentes
153=Aqui pode definir o número de perfis mostrados na lista de perfis.
154=Mostrar este número de perfis recentes (0-10):
134=Maximum character counts for recent profiles (40-1000):
159=Eliminar automaticamente os perfis em falta
172=Maximum character counts for recent profiles
173=Limits the number of characters displayed for each listed recent profile.
'-------------------------------------------------------------------------------------
' Warning/Error/Info messages ***
'-------------------------------------------------------------------------------------
174=Unknown error
175=Failed to dump file (infinite main loop).
176=The map of the file is empty.
180=Wrong map file detected.
147=O volume não tem um grupo de blocos contíguos, livres, suficientemente grande para conter o ficheiro inteiro.
164=Tem a certeza de que deseja eliminar o elemento seleccionado?
165=Tem a certeza de que deseja eliminar os elementos seleccionados?
166=Confirmar
205=Não é possível executar o WinContig nesta versão do sistema operativo.
233=Não é possível adicionar '%s'.
307=Não foi possível definir a classe de prioridade seleccionada.
360=Não é possível apagar o ficheiro '%s' devido ao seguinte erro:\n\n%s
374=O elemento seleccionado foi adicionado à lista de exclusão.
375=Os elementos seleccionados foram adicionados à lista de exclusão.
376=Os elementos seleccionados já estão na lista de exclusão.
465=Máscaras em duplicado
466=Uma ou mais máscaras estão incluidas em ambas as listas de Exclusão e Inclusão. Os elementos correspondentes a estas máscaras não serão tratados pelo WinContig.
467=Fechar, em qualquer caso
468=Editar as máscaras
490=Disco SSD Detectado
494=Disco SSD (Solid-State Device)
491=Um disco SSD não apresenta uma vantagem no desempenho pelo facto de ter uma desfragmentação dum HDD tradicional. A desfragmentação de ficheiros provoca numerosos processos de escrita e pode conduzir a uma utilização excessiva sobre certas zonas do disco. Aconselha-se a não desfragmentar ficheiros em discos Solid-State.
492=Desfragmentar de qualquer maneira
493=Não desfragmentar
149=Não existe memória física suficiente ou recursos de sistema disponíveis para deafragmentar o ficheiro.
'-------------------------------------------------------------------------------------
' General Button Captions ***
'-------------------------------------------------------------------------------------
395=Sim
396=Não
397=OK
398=Cancelar
406=Continuar
407=Sair
142=Fechar
'-------------------------------------------------------------------------------------
' File Open Error Messages ***
'-------------------------------------------------------------------------------------
167=Erro: Insuficiência de memória/recursos. Não é possível executar!
168=Erro: Ficheiro não encontrado. Não é possível executar!
169=Erro: Caminho não encontrado. Não é possível executar!
170=Erro: Problema no formato de ficheiro. Não é possível executar!
'-------------------------------------------------------------------------------------
' "Fragmentation Details" dialog box ***
'-------------------------------------------------------------------------------------
259=Fragmentos
260=Nome:
261=Caminho:
262=Tipo:
263=Tamanho:
264=Tamanho no disco:
265=Fragmentos:
266=Blocos:
267=Informação de fragmento:
269=Geral
270=#
271=Blocos do ficheiro
272=Bloco inicial
273=Bloco final
286=Tamanho (bytes)
287=% do ficheiro
276=Ficheiro ainda não analisado
277=Este elemento não é um ficheiro
278=Foi encontrado um erro ao tentar analisar o ficheiro
279=Este elemento não existe
280=Este ficheiro não ocupa nenhum bloco
281=bytes
'-------------------------------------------------------------------------------------
' "Defragmentation Report" dialog box ***
'-------------------------------------------------------------------------------------
184=Relatório da desfragmentação
185=Informações:
186=A desfragmentação foi completada.
189=Número de ficheiros processados:
190=Número de ficheiros fragmentados:
191=Número de ficheiros contíguos:
192=Número de ficheiros desfragmentados:
193=Número de ficheiros não desfragmentados devido a erros:
423=Esta caixa de diálogo mostra informações sobre os ficheiros que foram desfragmentados.
'-------------------------------------------------------------------------------------
' Shutdown dialog box ***
'-------------------------------------------------------------------------------------
194=Desligar o computador
196=O computador será desligado em 15 segundos.
197=Erro OpenProcessToken.
198=Erro AdjustTokenPrivileges.
'-------------------------------------------------------------------------------------
' About dialog box ***
'-------------------------------------------------------------------------------------
201=Todos os direitos reservados.
202=Freeware para uso comercial e pessoal.
203=WinContig consolida os fragmentos dos ficheiros fragmentados, de modo que ocupem apenas um espaço contíguo no volume. O sistema é assim capaz de aceder aos ficheiros de maneira mais eficaz.
204=Informações sobre
298=Página web:
299=E-mail:
'-------------------------------------------------------------------------------------
' Crash dialog box ***
'-------------------------------------------------------------------------------------
77=Erro de exceção do WinContig
78=WinContig deixou de funcionar
79=Devemos assinalar que o programa encontrou um erro. Queira copiar a informação do erro de exceção para o Clipboard, e enviá-la para nós:
80=Detalhes do problema
81=Fechar o programa
63=A deteção SSD poderá ser incompatível com certas configurações de hardware específicas. Queira selecionar "Desactivar a detecção SSD(Solid-State Drive)" no menu "Opções".
'-------------------------------------------------------------------------------------
' Disclaimer ***
'-------------------------------------------------------------------------------------
206=Licença
221=Copy the text and put it on the Clipboard.
'-------------------------------------------------------------------------------------
' Command line switches ***
'-------------------------------------------------------------------------------------
208=Parâmetros da linha de comando
389=Parâmetros da linha de comando
390=WinContig aceita alguns parâmetros de linha de comando opcionais que podem ser usados para controlar o uso do programa.
'-------------------------------------------------------------------------------------
' Defragmentation/Analysis process Interrupted ***
'-------------------------------------------------------------------------------------
210=Por favor, espere até ao final do processo do ficheiro em curso...
'-------------------------------------------------------------------------------------
' Disclaimer - RTF Format ***
'-------------------------------------------------------------------------------------
$d$
{\rtf1\ansi\ansicpg1252\deff0\deflang1033\deflangfe1040
\qc {\b\f0\fs24 Cláusula de não-responsabilidade}
\par\par
\pard O software e todo tipo de documentação relativo a ele são fornecidos pelo autor "assim como estão", sem nenhuma garantia de qualquer tipo, seja expressa seja implícita, compreendidas eventuais garantias ou condições relativas à comercialização e idoneidade para um fim particular. Em nenhum caso o autor será responsável por danos de qualquer tipo, directos, indirectos ou acidentais (inclusive, por exemplo, danos por falta de lucro, interrupção da actividade, perda de informações confidenciais ou outras perdas de natureza económica) derivadas ou correlacionados à utilização ou à incapacidade de utilizar o software, ainda que o autor tenha sido avisado da eventualidade de se verificarem tais danos. O utilizador assume expressamente a inteira responsabilidade e os riscos pelo uso deste produto de software.
\par }}
$d$
'--------------------------------------------------------------------------------------------------
' Command line switches - RTF Format *** Parâmetros da Linha de Comando - Formato RTF
'--------------------------------------------------------------------------------------------------
$c$
{\rtf1\ansi\ansicpg1252\deff0\deflang1040
\viewkind4\uc1\pard\lang1040\b\f0\fs16 SYNTAX\par
\b0\par
WINCONTIG.EXE [source] [/ANALYZE|/DEFRAG] [/CHKDSK:0|/CHKDSK:1|/CHKDSK:2] [/CLEAN:0|/CLEAN:1|/CLEAN:2] [/CLOSE|/CLOSEIFOK|/SHUTDOWN] [/DUP] [/FULLROW] [/HELP|/?] [/LANG:xx] [/NOGUI] [/NOINI] [/NOPROMPT] [/NOSCROLL] [/ONTOP] [/PROF:"profile"] [/QUICK]\par
\par
\b\par
NOTAS IMPORTANTES\par
\b0\par
\pard{\pntext\f3\'B7\tab}{\*\pn\pnlvlblt\pnf3\pnindent360{\pntxtb\'B7}}\fi-360\li360\tx360 Os parâmetros não são "case sensitive", assim, por exemplo, \b /CLOSE\b0  é idêntico a \b /close\b0 .\par
{\pntext\f3\'B7\tab}Quando utilizar vários parâmetros, separe-os por um espaço. Por exemplo, use a seguinte linha de comando para carregar um perfil e iniciar a desfragmentação de ficheiro the file defragmentation:\par
\pard\par
\pard\fi360\b WINCONTIG.EXE /DEFRAG /PROF:"c:\\datas\\profile.wcp"\b0\par
\pard\par
\par
De seguida apresenta-se a lista de parâmetros do WinContig.\par
\par
\pard\fi-1418\li1418\tx1418\b source\b0\tab Especifica o ficheiro ou a pasta a ser carregada no WinContig.\par
\pard\par
\pard\fi-1418\li1418\tx1418\b\tab NOTAS IMPORTANTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 Deve indicar o caminho completo de \i source\i0\par
{\pntext\f1\'B7\tab}Terá de incluir o caminho completo de \i source\i0 entre aspas ("")\par
\pard\li1418\tx1418\par
Por exemplo, use a linha de comando seguinte para carregar o ficheiro \i personal.txt\i0  situado em \i c:\\documents\i0 :\par
\par
\b WINCONTIG.EXE "c:\\documents\\personal.txt"\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /ANALYZE\b0\tab Inicia automaticamente a análise dos elementos carregados no WinContig.\par
\par
\b /CHKDSK:0\b0\tab Desactiva a análise automática do disco. \par
\par
\b /CHKDSK:1\b0\tab Inicia automaticamente a análise do disco.\par
\par
\b /CHKDSK:2\b0\tab Pergunta ao utilizador antes de iniciar a análise do disco.\par
\par
\b /CLEAN:0\tab\b0 Desactiva a limpeza automatica dos ficheiros emporários.\par
\par
\b /CLEAN:1\tab\b0 Inicia automaticamente a limpeza dos ficheiros temporários.\par
\par
\b /CLEAN:2\tab\b0 Pergunta ao utilizador antes de iniciar a limpeza dos ficheiros temporários.\par
\par
\b /CLOSE\b0\tab Utilizado para fechar automaticamente o WinContig após ter completado a desfragmentação.\par
\par
\b /CLOSEIFOK\b0\tab Utilizado para fechar automaticamente o WinContig após ter completado a desfragmentação, se todos os ficheiros tiverem sido desfragmentados, senão mantém-se aberto. 
Se utilizar este parâmetro conjuntamente com o parâmetro \b /NOGUI \b0 , o  WinContig mostrará a janela principal após ter completado a desfragmentação se um ou mais ficheiros não tiverem sido desfragmentados com sucesso.\par
\par
\b /DEFRAG\b0\tab Inicia automaticamente a desfragmentação dos elementos carregados no WinContig.\par
\par
\b /DUP\b0\tab Permite ter elementos em duplicado na lista de ficheiros. O WinContig não autoriza, por defeito, elementos duplicados na lista de ficheiros. Quando se usa o parâmetro \b /DUP\b0 switch, o WinContig adiciona os ficheiros à lista de ficheiros mais rapidamente. Esta opção é útil se desejar carregar um perfil muito grande mais rápido e se estiver certo de que não existem elementos duplicados no perfil.\par
\par
\b /FULLROW\b0\tab Activa a seleção de linhas inteiras.\par
\par
\b /HELP \b0 or \b/?\b0 \tab Mostra esta caixa de diálogo.\par
\par
\b /LANG:\b0\i xx\i0\tab Força a língua utilizada pelo interface do utilizador. \i xx \i0 precisa o código da língua, por exemplo, \i en \i0 representa English, enquanto \i fr \i0 representa French. 
Se indicar o parâmetro \b/LANG:auto \b0, o WinContig utilizará a língua por defeito do UI do sistema (se uportado).\par
\par
\b /NOGUI\b0\tab Utilizado para ocultar a janela principal do WinContig durante o processo de análise ou desfragmentação. Quando se utiliza o parâmetro \b /NOGUI\b0 , o WinContig disponibiliza os códigos de saída que indicam o nível de sucesso dum comando. \par
\par
\tab\b Códigos de saída\b0\par
\par
\tab Os códigos de saída da linha de comando são definidos pelo WinContig.\par
\par
\tab\b 0\b0\tab Sucesso.\par
\tab\b 1\b0\tab Perfil inválido ou em falta.\par
\tab\b 2\b0\tab Erros encontrados durante a verificação do disco.\par
\tab\b 3\b0\tab Nem todos os elementos fora desfragmentados com sucesso.\par
\tab\b 4\b0\tab Nem todos os elementos foram analisados com sucesso.\par
\tab\b 5\b0\tab Elemento inválido ou em falta.\par
\par
\b /NOINI\b0\tab Utilizado para suprimir a escrita do ficheiro de configuração "WinContig.ini".\par
\par
\b /NOPROMPT\b0\tab Utilizado para desactivar as mensagens de confirmação.\par
\par
\b /NOSCROLL\b0\tab Desactiva a rolagem dos ficheiros quando o WinContig executa uma análise ou uma desfragmentação.\par
\par
\b /ONTOP\b0\tab Coloca a janela principal do WinContig em cima (sobre todas as outras).\par
\par
\b /PROF:\b0\i "profile"\i0\tab Utilizado para carregar o perfil \i profile\i0 .\par
\par
\b\tab NOTAS IMPORTANTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 Deve indicar o caminho completo do perfil\par
{\pntext\f1\'B7\tab}Deve incluir o caminho completo do perfil em aspas ("")\par
\pard\li1418\tx1418\par
Por exemplo, use a linha de comando seguinte para carregar o perfil \i data.wcp\i0 situado em \i c:\\profiles\i0 :\par
\par
\b WINCONTIG.EXE /PROF:"c:\\profiles\\data.wcp"\par
\pard\fi-1418\li1418\tx1418\b0\par
\b /QUICK\b0\tab Utilizado para desactivar as optimizações durante a desfragmentação (i.e. o WinContig não tentará preencher os buracos e não tentará desfragmentar parcialmente os ficheiros que não foi possível desfragmentar totalmente). Isto permitirá completar a desfragmentação mais rapidamente.\par
\par
\b /SHUTDOWN\b0\tab Utilizado para desligar o computador quando o WinContig tiver acabado a desfragmentação.\par
\par
}
$c$





